AccumulationRegisters/БюджетРасходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>БюджетРасходы</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяРасхода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/БюджетДоходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>БюджетДоходы</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаПлан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяДохода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/СтруктураБюджетаДоходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СтруктураБюджетаДоходы</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЭтоГруппа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Родитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяДохода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СтруктураБюджетаРасходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СтруктураБюджетаРасходы</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЭтоГруппа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Родитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяРасхода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/БюджетДоходовРасходов/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область ФормированиеДвижений

Процедура СформироватьДвиженияБюджетПлан(ТаблицаРасходы, ТаблицаДоходы, ТаблицаРеквизиты, Движения, Отказ) Экспорт
	
	Параметры = ПодготовитьПараметрыБюджетПлан(ТаблицаРасходы, ТаблицаДоходы, ТаблицаРеквизиты);
	
	Реквизиты = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Параметры.Реквизиты[0]);
	
	Для Каждого СтрокаТаблицы Из Параметры.ТаблицаРасходы Цикл
		НовоеДвижение = Движения.БюджетРасходы.Добавить();
		НовоеДвижение.Регистратор = Реквизиты.Регистратор;
		НовоеДвижение.Организация = Реквизиты.Организация;
		НовоеДвижение.СуммаПлан   = СтрокаТаблицы.Сумма;
		ЗаполнитьЗначенияСвойств(НовоеДвижение, СтрокаТаблицы);
	КонецЦикла;
	
	Для Каждого СтрокаТаблицы Из Параметры.ТаблицаДоходы Цикл
		НовоеДвижение = Движения.БюджетДоходы.Добавить();
		НовоеДвижение.Регистратор = Реквизиты.Регистратор;
		НовоеДвижение.Организация = Реквизиты.Организация;
		НовоеДвижение.СуммаПлан   = СтрокаТаблицы.Сумма;
		ЗаполнитьЗначенияСвойств(НовоеДвижение, СтрокаТаблицы);
	КонецЦикла;
	
	Движения.БюджетРасходы.Записывать = Истина;
	Движения.БюджетДоходы.Записывать = Истина;
	
КонецПроцедуры

Процедура СформироватьСтруктуруБюджета(ТаблицаСтруктураДоходов, ТаблицаСтруктураРасходов, ТаблицаРеквизиты, Движения, Отказ) Экспорт
	
	Параметры = ПодготовитьПараметрыСтруктураБюджета(ТаблицаСтруктураДоходов, ТаблицаСтруктураРасходов, ТаблицаРеквизиты);
	
	Реквизиты = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Параметры.Реквизиты[0]);
	
	Для Каждого СтрокаТаблицы Из Параметры.ТаблицаСтруктураДоходов Цикл
		Запись = Движения.СтруктураБюджетаДоходы.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Реквизиты);
		ЗаполнитьЗначенияСвойств(Запись, СтрокаТаблицы);
	КонецЦикла;
	
	Для Каждого СтрокаТаблицы Из Параметры.ТаблицаСтруктураРасходов Цикл
		Запись = Движения.СтруктураБюджетаРасходы.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Реквизиты);
		ЗаполнитьЗначенияСвойств(Запись, СтрокаТаблицы);
	КонецЦикла;
	
	Движения.СтруктураБюджетаДоходы.Записывать = Истина;
	Движения.СтруктураБюджетаРасходы.Записывать = Истина;
	
КонецПроцедуры

Процедура СформироватьДвиженияДоходыФактБюджет(ТаблицаБюджетДоходы, ТаблицаРеквизиты, Движения, Отказ) Экспорт
	
	Параметры = ПодготовитьПараметрыДоходыФактБюджет(ТаблицаБюджетДоходы, ТаблицаРеквизиты);
	
	Реквизиты = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Параметры.Реквизиты[0]);
	
	Для Каждого СтрокаТаблицы Из Параметры.ТаблицаБюджетДоходы Цикл
		НовоеДвижение = Движения.БюджетДоходы.Добавить();
		НовоеДвижение.Регистратор  = Реквизиты.Регистратор;
		НовоеДвижение.Организация  = Реквизиты.Организация;
		НовоеДвижение.Период       = Реквизиты.Период;
		НовоеДвижение.СуммаФакт    = СтрокаТаблицы.Сумма;
		НовоеДвижение.СтатьяДохода = СтрокаТаблицы.СтатьяДохода;
	КонецЦикла;
	
	Движения.БюджетДоходы.Записывать = Истина;
	
КонецПроцедуры

Процедура СформироватьДвиженияРасходыФактБюджет(ТаблицаБюджетРасходы, ТаблицаРеквизиты, Движения, Отказ) Экспорт
	
	Параметры = ПодготовитьПараметрыРасходыФактБюджет(ТаблицаБюджетРасходы, ТаблицаРеквизиты);
	
	Реквизиты = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Параметры.Реквизиты[0]);
	
	Для Каждого СтрокаТаблицы Из Параметры.ТаблицаБюджетРасходы Цикл
		НовоеДвижение = Движения.БюджетРасходы.Добавить();
		НовоеДвижение.Регистратор             = Реквизиты.Регистратор;
		НовоеДвижение.Организация             = Реквизиты.Организация;
		НовоеДвижение.Период                  = Реквизиты.Период;
		НовоеДвижение.НаправлениеДеятельности = Реквизиты.НаправлениеДеятельности;
		НовоеДвижение.СуммаФакт               = СтрокаТаблицы.СуммаФакт;
		НовоеДвижение.СтатьяРасхода           = СтрокаТаблицы.СтатьяРасхода;
	КонецЦикла;
	
	Движения.БюджетРасходы.Записывать = Истина;
	
КонецПроцедуры

#КонецОбласти

// Функция-конструктор для колонок с периодами детализации бюджета для вывода на форму и на печать.
//
// Возвращаемое значение:
//    ТаблицаЗначений - см. тело функции
//
Функция НовыйКолонкиДетализации() Экспорт
	
	КолонкиДетализации = Новый ТаблицаЗначений;
	КолонкиДетализации.Колонки.Добавить("ИмяКолонки", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	КолонкиДетализации.Колонки.Добавить("Заголовок", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	КолонкиДетализации.Колонки.Добавить("Дата", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	
	Возврат КолонкиДетализации;
	
КонецФункции

// Процедура заполняет дополнительные колонки с периодами в зависимости от выбранной детализации.
//
// Параметры:
//    КолонкиДетализации - ТаблицаЗначений - Таблица значений с описанием колонок.
//    ДанныеДокумента - Структура, ДокументОбъект.Бюджет - Коллекция с обязательными полями "Детализация" и "Период"
//
Процедура ЗаполнитьКолонкиДетализации(КолонкиДетализации, ДанныеДокумента) Экспорт
	
	КолонкиДетализации.Очистить();
	
	Если ДанныеДокумента.Детализация = Перечисления.Периодичность.Квартал Тогда
		НомерКвартала = 1;
		Пока НомерКвартала <= 4 Цикл
			Строка = КолонкиДетализации.Добавить();
			Строка.ИмяКолонки = "Квартал" + НомерКвартала;
			Строка.Заголовок = СтрШаблон(НСтр("ru='%1 квартал'"), НомерКвартала);
			Строка.Дата = Дата(Год(ДанныеДокумента.Период), НомерКвартала * 3 , 1);
			НомерКвартала = НомерКвартала + 1;
		КонецЦикла;
	ИначеЕсли ДанныеДокумента.Детализация = Перечисления.Периодичность.Месяц Тогда
		НомерМесяца = 1;
		ГодДокумента = НачалоГода(ДанныеДокумента.Период);
		Пока НомерМесяца <= 12 Цикл
			Строка = КолонкиДетализации.Добавить();
			Месяц = Формат(ДобавитьМесяц(ГодДокумента, НомерМесяца - 1), "ДФ=MMMM");
			Строка.ИмяКолонки = Месяц;
			Строка.Заголовок = Месяц;
			Строка.Дата = Дата(Год(ДанныеДокумента.Период), НомерМесяца, 1);
			НомерМесяца = НомерМесяца + 1;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Функция-конструктор для данных бюджета для их вывода на форму и на печать.
//
// Возвращаемое значение:
//    Структура - Описание:
// * Реквизиты - ТаблицаЗначений - Реквизиты документа, см. НовыйРеквизитыБюджета
// * Доходы - ТаблицаЗначений - таблица с доходами бюджета, см. НовыйДоходыБюджета
// * Расходы - ТаблицаЗначений - таблица с расходами бюджета, см. НовыйРасходыБюджета
// * РасходыПоНаправлениямДеятельности - ТаблицаЗначений - таблица с расходами бюджета по направлениям деятельности, см. НовыйРасходыПоНаправлениямДеятельности
// * СтруктураДоходов - ТаблицаЗначений - структура доходов бюджета, см. НовыйСтруктураДоходовБюджета
// * СтруктураРасходов - ТаблицаЗначений - структура расходов бюджета, см. НовыйСтруктураРасходовБюджета
//
Функция НовыйДанныеБюджета() Экспорт
	
	МетаданныеБюджета = Метаданные.Документы.Бюджет;
	
	ДанныеБюджета = Новый Структура;
	ДанныеБюджета.Вставить("Реквизиты", НовыйРеквизитыБюджета(МетаданныеБюджета));
	ДанныеБюджета.Вставить("Доходы", НовыйДоходыБюджета(МетаданныеБюджета));
	ДанныеБюджета.Вставить("Расходы", НовыйРасходыБюджета(МетаданныеБюджета));
	ДанныеБюджета.Вставить("РасходыПоНаправлениямДеятельности", НовыйРасходыПоНаправлениямДеятельности(МетаданныеБюджета));
	ДанныеБюджета.Вставить("СтруктураДоходов", НовыйСтруктураДоходовБюджета(МетаданныеБюджета));
	ДанныеБюджета.Вставить("СтруктураРасходов", НовыйСтруктураРасходовБюджета(МетаданныеБюджета));
	
	Возврат ДанныеБюджета;
	
КонецФункции

// Функция-конструктор для данных корректировки бюджета для их вывода на форму и на печать.
//
// Возвращаемое значение:
//    Структура - аналогично НовыйДанныеБюджета, с дополнительными колонками СуммаКорректировки, СуммаДоКорректировки - Поля:
// * Реквизиты - ТаблицаЗначений - Реквизиты документа, см. НовыйРеквизитыБюджета
// * Доходы - ТаблицаЗначений - таблица с доходами бюджета, см. НовыйДоходыБюджета
// * Расходы - ТаблицаЗначений - таблица с расходами бюджета, см. НовыйРасходыБюджета
// * РасходыПоНаправлениямДеятельности - ТаблицаЗначений - таблица с расходами бюджета по направлениям деятельности, см. НовыйРасходыПоНаправлениямДеятельности
// * СтруктураДоходов - ТаблицаЗначений - структура доходов бюджета, см. НовыйСтруктураДоходовБюджета
// * СтруктураРасходов - ТаблицаЗначений - структура расходов бюджета, см. НовыйСтруктураРасходовБюджета
//
Функция НовыйДанныеКорректировки() Экспорт
	
	ДанныеКорректировки = НовыйДанныеБюджета();
	МетаданныеКорректировки = Метаданные.Документы.КорректировкаБюджета;
	
	ДанныеКорректировки.Реквизиты.Колонки.Добавить("Бюджет", МетаданныеКорректировки.Реквизиты.Бюджет.Тип);
	ДанныеКорректировки.Реквизиты.Колонки.Добавить("ОстатокНаНачалоДоКорректировки", 
		МетаданныеКорректировки.Реквизиты.ОстатокНаНачалоДоКорректировки.Тип);
	ДанныеКорректировки.Реквизиты.Колонки.Добавить("ОстатокНаНачалоКорректировка", 
		МетаданныеКорректировки.Реквизиты.ОстатокНаНачалоКорректировка.Тип);
		
	ДополнитьКолонкамиКорректировки(ДанныеКорректировки.Доходы, "Доходы", МетаданныеКорректировки);
	ДополнитьКолонкамиКорректировки(ДанныеКорректировки.Расходы, "Расходы", МетаданныеКорректировки);
	ДополнитьКолонкамиКорректировки(
		ДанныеКорректировки.РасходыПоНаправлениямДеятельности, "РасходыПоНаправлениямДеятельности", МетаданныеКорректировки);
	
	Возврат ДанныеКорректировки;
	
КонецФункции

// Процедура устанавливает текущую строку в дереве бюджета при открытии формы из отчета "План-фактный анализ"
//
// Параметры:
//    Форма - ФормаКлиентскогоПриложения - Открываемая форма бюджета или корректировки
//
Процедура УстановитьТекущуюСтрокуИзПланФактногоАнализа(Форма) Экспорт
	
	ПараметрыПоискаСтроки = Неопределено;
	Если Не Форма.Параметры.Свойство("ПараметрыПоискаСтроки", ПараметрыПоискаСтроки) Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторСтроки = Неопределено;
	Если ПараметрыПоискаСтроки.ТипЗаписи = Отчеты.ПланФактныйАнализБюджета.ТипЗаписиОстатокНаНачало() Тогда
		ИдентификаторСтроки = Форма.ИдентификаторОстатокНачало;
	ИначеЕсли ПараметрыПоискаСтроки.ТипЗаписи = Отчеты.ПланФактныйАнализБюджета.ТипЗаписиОстатокНаКонец() Тогда
		ИдентификаторСтроки = Форма.ИдентификаторОстатокКонец;
	ИначеЕсли ПараметрыПоискаСтроки.ТипЗаписи = Отчеты.ПланФактныйАнализБюджета.ТипЗаписиДоход() Тогда
		ИдентификаторСтроки = Форма.ИдентификаторДоходы;
		СтрокаРазделДоходы = Форма.ДеревоБюджета.НайтиПоИдентификатору(ИдентификаторСтроки);
		ИскомаяСтрока = СтрокаПоСтатьеДДСРекурсивно(СтрокаРазделДоходы, ПараметрыПоискаСтроки);
		Если ИскомаяСтрока <> Неопределено Тогда
			ИдентификаторСтроки = ИскомаяСтрока.ПолучитьИдентификатор();
		КонецЕсли;
	ИначеЕсли ПараметрыПоискаСтроки.ТипЗаписи = Отчеты.ПланФактныйАнализБюджета.ТипЗаписиРасход() Тогда
		ИдентификаторСтроки = Форма.ИдентификаторРасходы;
		СтрокаРазделРасходы = Форма.ДеревоБюджета.НайтиПоИдентификатору(ИдентификаторСтроки);
		Если ЗначениеЗаполнено(ПараметрыПоискаСтроки.НаправлениеДеятельности) Тогда
			ИскомаяСтрока = СтрокаРасходыРекурсивно(СтрокаРазделРасходы, ПараметрыПоискаСтроки);
			Если ИскомаяСтрока <> Неопределено Тогда
				ИдентификаторСтроки = ИскомаяСтрока.ПолучитьИдентификатор();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ИдентификаторСтроки <> Неопределено Тогда
		Форма.Элементы.ДеревоБюджета.ТекущаяСтрока = ИдентификаторСтроки;
		Форма.Элементы.ДеревоБюджета.ТекущийЭлемент = Форма.Элементы.ДеревоБюджетаСуммаГод;
		Для Каждого КолонкаДетализации Из Форма.КолонкиДетализации Цикл
			Если КолонкаДетализации.Дата = ПараметрыПоискаСтроки.ПериодДетализации Тогда
				Форма.Элементы.ДеревоБюджета.ТекущийЭлемент = Форма.Элементы["ДеревоБюджета" + КолонкаДетализации.ИмяКолонки];
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ФормированиеДвижений

Функция ПодготовитьПараметрыБюджетПлан(ТаблицаРасходы, ТаблицаДоходы, ТаблицаРеквизиты)
	
	Параметры = Новый Структура;
	
	// Подготовка таблицы шапки документа.
	СписокОбязательныхКолонок = ""
	+ "Период,"      // <Дата> - дата докумета, записывающего движения
	+ "Регистратор," // <Регистратор> - документ, записывающий движения в регистры
	+ "Организация"  // <СправочникСсылка.Организации> - организация документа
	;
	Параметры.Вставить("Реквизиты", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
		ТаблицаРеквизиты, СписокОбязательныхКолонок));
	
	// Подготовка таблицы расходов по бюджету
	СписокОбязательныхКолонок = ""
	+ "Период,"                  // <Дата> - Дата, на которую запланирован бюджет
	+ "НаправлениеДеятельности," // <СправочникСсылка.НаправлениеДеятельности> - Направление деятельности
	+ "СтатьяРасхода,"           // <СправочникСсылка.СтатьяДвиженияДенежныхСредств> - Статья ДДС по расходам
	+ "Сумма"                    // <Число(15,2)> - сумма
	;
	
	Параметры.Вставить("ТаблицаРасходы", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
		ТаблицаРасходы, СписокОбязательныхКолонок));
		
		
	// Подготовка таблицы доходов по бюджету
	СписокОбязательныхКолонок = ""
	+ "Период,"       // <Дата> - Дата, на которую запланирован бюджет
	+ "СтатьяДохода," // <СправочникСсылка.СтатьяДвиженияДенежныхСредств> - Статья ДДС по доходам
	+ "ЭтоГруппа,"    // <Булево> - Признак, что это группа
	+ "Сумма"         // <Число(15,2)> - сумма
	;
	
	Параметры.Вставить("ТаблицаДоходы", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
		ТаблицаДоходы, СписокОбязательныхКолонок));
	
	Возврат Параметры;
	
КонецФункции

Функция ПодготовитьПараметрыСтруктураБюджета(ТаблицаСтруктураДоходов, ТаблицаСтруктураРасходов, ТаблицаРеквизиты)
	
	Параметры = Новый Структура;
	
	// Подготовка таблицы шапки документа.
	СписокОбязательныхКолонок = ""
	+ "Период,"      // <Дата> - дата докумета, записывающего движения
	+ "Регистратор," // <Регистратор> - документ, записывающий движения в регистры
	+ "Организация"  // <СправочникСсылка.Организации> - организация документа,
	;
	Параметры.Вставить("Реквизиты", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
		ТаблицаРеквизиты, СписокОбязательныхКолонок));
		
	// Подготовка таблицы структуры доходов по бюджету
	СписокОбязательныхКолонок = ""
	+ "СтатьяДохода,"            // <СправочникСсылка.СтатьяДвиженияДенежныхСредств> - Статья ДДС по доходам
	+ "Родитель,"                // <СправочникСсылка.СтатьяДвиженияДенежныхСредств> - Группа статей доходам
	+ "ЭтоГруппа"                // <Булево> - Признак, что это группа
	;
	
	Параметры.Вставить("ТаблицаСтруктураДоходов", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
		ТаблицаСтруктураДоходов, СписокОбязательныхКолонок));
	
	// Подготовка таблицы структуры расходов по бюджету
	СписокОбязательныхКолонок = ""
	+ "НаправлениеДеятельности," // <СправочникСсылка.НаправлениеДеятельности> - Направление деятельности
	+ "СтатьяРасхода,"           // <СправочникСсылка.СтатьяДвиженияДенежныхСредств> - Статья ДДС по расходам
	+ "Родитель,"                // <СправочникСсылка.СтатьяДвиженияДенежныхСредств> - Группа статей расходов
	+ "ЭтоГруппа"                // <Булево> - Признак, что это группа
	;
	
	Параметры.Вставить("ТаблицаСтруктураРасходов", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
		ТаблицаСтруктураРасходов, СписокОбязательныхКолонок));
	
	Возврат Параметры;
	
КонецФункции

Функция ПодготовитьПараметрыДоходыФактБюджет(ТаблицаБюджетДоходы, ТаблицаРеквизиты)
	
	Параметры = Новый Структура;
	
	// Подготовка таблицы шапки документа.
	СписокОбязательныхКолонок = ""
	+ "Период,"      // <Дата> - дата докумета, записывающего движения
	+ "Регистратор," // <Регистратор> - документ, записывающий движения в регистры
	+ "Организация"  // <СправочникСсылка.Организации> - организация документа
	;
	Параметры.Вставить("Реквизиты", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
		ТаблицаРеквизиты, СписокОбязательныхКолонок));
	
	// Подготовка таблицы доходов по бюджету
	СписокОбязательныхКолонок = ""
	+ "СтатьяДохода," // <СправочникСсылка.СтатьяДвиженияДенежныхСредств> - Статья ДДС по доходам
	+ "Сумма"         // <Число(15,2)> - сумма
	;
	
	Параметры.Вставить("ТаблицаБюджетДоходы", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
		ТаблицаБюджетДоходы, СписокОбязательныхКолонок));
	
	Возврат Параметры;
	
КонецФункции

Функция ПодготовитьПараметрыРасходыФактБюджет(ТаблицаБюджетРасходы, ТаблицаРеквизиты)
	
	Параметры = Новый Структура;
	
	// Подготовка таблицы шапки документа.
	СписокОбязательныхКолонок = ""
	+ "Период,"      // <Дата> - дата докумета, записывающего движения
	+ "Регистратор," // <Регистратор> - документ, записывающий движения в регистры
	+ "Организация,"  // <СправочникСсылка.Организации> - организация документа,
	+ "НаправлениеДеятельности"  // <СправочникСсылка.НаправлениеДеятельности> - направление деятельности, по которому произведен платеж
	;
	Параметры.Вставить("Реквизиты", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
		ТаблицаРеквизиты, СписокОбязательныхКолонок));
	
	// Подготовка таблицы доходов по бюджету
	СписокОбязательныхКолонок = ""
	+ "СтатьяРасхода," // <СправочникСсылка.СтатьяДвиженияДенежныхСредств> - Статья ДДС по расходам
	+ "СуммаФакт"      // <Число(15,2)> - сумма
	;
	
	Параметры.Вставить("ТаблицаБюджетРасходы", ОбщегоНазначенияБПВызовСервера.ПолучитьТаблицуПараметровПроведения(
		ТаблицаБюджетРасходы, СписокОбязательныхКолонок));
	
	Возврат Параметры;
	
КонецФункции

#КонецОбласти

Функция НовыйРеквизитыБюджета(МетаданныеДокумента)
	
	РеквизитыДокументаИзМетаданных = МетаданныеДокумента.Реквизиты;
	
	РеквизитыБюджета = Новый ТаблицаЗначений;
	РеквизитыБюджета.Колонки.Добавить("Организация", РеквизитыДокументаИзМетаданных.Организация.Тип);
	РеквизитыБюджета.Колонки.Добавить("Период", РеквизитыДокументаИзМетаданных.Период.Тип);
	РеквизитыБюджета.Колонки.Добавить("Детализация", РеквизитыДокументаИзМетаданных.Детализация.Тип);
	РеквизитыБюджета.Колонки.Добавить("Утвержден", РеквизитыДокументаИзМетаданных.Утвержден.Тип);
	РеквизитыБюджета.Колонки.Добавить("ОстатокНаНачало", РеквизитыДокументаИзМетаданных.ОстатокНаНачало.Тип);
	РеквизитыБюджета.Колонки.Добавить("Комментарий", РеквизитыДокументаИзМетаданных.Комментарий.Тип);
	
	Возврат РеквизитыБюджета;
	
КонецФункции

Функция НовыйДоходыБюджета(МетаданныеДокумента)
	
	РеквизитыДоходовИзМетаданных = МетаданныеДокумента.ТабличныеЧасти.Доходы.Реквизиты;
	
	ДоходыБюджета = Новый ТаблицаЗначений;
	ДоходыБюджета.Колонки.Добавить("ДатаПланирования", РеквизитыДоходовИзМетаданных.ДатаПланирования.Тип);
	ДоходыБюджета.Колонки.Добавить("СтатьяДохода", РеквизитыДоходовИзМетаданных.СтатьяДохода.Тип);
	ДоходыБюджета.Колонки.Добавить("ЭтоГруппа", РеквизитыДоходовИзМетаданных.ЭтоГруппа.Тип);
	ДоходыБюджета.Колонки.Добавить("Сумма", РеквизитыДоходовИзМетаданных.Сумма.Тип);
	
	Возврат ДоходыБюджета;
	
КонецФункции

Функция НовыйРасходыБюджета(МетаданныеДокумента)
	
	РеквизитыРасходовИзМетаданных = МетаданныеДокумента.ТабличныеЧасти.Расходы.Реквизиты;
	
	РасходыБюджета = Новый ТаблицаЗначений;
	РасходыБюджета.Колонки.Добавить("ДатаПланирования", РеквизитыРасходовИзМетаданных.ДатаПланирования.Тип);
	РасходыБюджета.Колонки.Добавить("НаправлениеДеятельности", РеквизитыРасходовИзМетаданных.НаправлениеДеятельности.Тип);
	РасходыБюджета.Колонки.Добавить("СтатьяРасхода", РеквизитыРасходовИзМетаданных.СтатьяРасхода.Тип);
	РасходыБюджета.Колонки.Добавить("ЭтоГруппа", РеквизитыРасходовИзМетаданных.ЭтоГруппа.Тип);
	РасходыБюджета.Колонки.Добавить("Сумма", РеквизитыРасходовИзМетаданных.Сумма.Тип);
	
	Возврат РасходыБюджета;
	
КонецФункции

Функция НовыйРасходыПоНаправлениямДеятельности(МетаданныеДокумента)
	
	РеквизитыРасходыПоНаправлениямДеятельности = МетаданныеДокумента.ТабличныеЧасти.РасходыПоНаправлениямДеятельности.Реквизиты;
	
	РасходыПоНаправлениямДеятельности = Новый ТаблицаЗначений;
	РасходыПоНаправлениямДеятельности.Колонки.Добавить("ДатаПланирования", РеквизитыРасходыПоНаправлениямДеятельности.ДатаПланирования.Тип);
	РасходыПоНаправлениямДеятельности.Колонки.Добавить("НаправлениеДеятельности", РеквизитыРасходыПоНаправлениямДеятельности.НаправлениеДеятельности.Тип);
	РасходыПоНаправлениямДеятельности.Колонки.Добавить("Сумма", РеквизитыРасходыПоНаправлениямДеятельности.Сумма.Тип);
	
	Возврат РасходыПоНаправлениямДеятельности;
	
КонецФункции

Функция НовыйСтруктураДоходовБюджета(МетаданныеДокумента)
	
	РеквизитыСтруктураДоходов = МетаданныеДокумента.ТабличныеЧасти.СтруктураДоходов.Реквизиты;
	
	СтруктураДоходов = Новый ТаблицаЗначений;
	СтруктураДоходов.Колонки.Добавить("СтатьяДохода", РеквизитыСтруктураДоходов.СтатьяДохода.Тип);
	СтруктураДоходов.Колонки.Добавить("Родитель", РеквизитыСтруктураДоходов.Родитель.Тип);
	СтруктураДоходов.Колонки.Добавить("ЭтоГруппа", РеквизитыСтруктураДоходов.ЭтоГруппа.Тип);
	
	Возврат СтруктураДоходов;
	
КонецФункции

Функция НовыйСтруктураРасходовБюджета(МетаданныеДокумента)
	
	РеквизитыСтруктураРасходов = МетаданныеДокумента.ТабличныеЧасти.СтруктураРасходов.Реквизиты;
	
	СтруктураРасходов = Новый ТаблицаЗначений;
	СтруктураРасходов.Колонки.Добавить("НаправлениеДеятельности", РеквизитыСтруктураРасходов.НаправлениеДеятельности.Тип);
	СтруктураРасходов.Колонки.Добавить("СтатьяРасхода", РеквизитыСтруктураРасходов.СтатьяРасхода.Тип);
	СтруктураРасходов.Колонки.Добавить("Родитель", РеквизитыСтруктураРасходов.Родитель.Тип);
	СтруктураРасходов.Колонки.Добавить("ЭтоГруппа", РеквизитыСтруктураРасходов.ЭтоГруппа.Тип);
	
	Возврат СтруктураРасходов;
	
КонецФункции

Процедура ДополнитьКолонкамиКорректировки(ТаблицаДанныхБюджета, ИмяТаблицы, МетаданныеДокумента)
	
	ТаблицаДанныхБюджета.Колонки.Добавить("СуммаДоКорректировки", МетаданныеДокумента.ТабличныеЧасти[ИмяТаблицы].Реквизиты.СуммаДоКорректировки.Тип);
	ТаблицаДанныхБюджета.Колонки.Добавить("СуммаКорректировки", МетаданныеДокумента.ТабличныеЧасти[ИмяТаблицы].Реквизиты.СуммаКорректировки.Тип);
	
КонецПроцедуры

Функция СтрокаРасходыРекурсивно(СтрокаДерева, ПараметрыПоискаСтроки)
	
	ИскомаяСтрока = Неопределено;
	Для Каждого ПодчиненнаяСтрока Из СтрокаДерева.ПолучитьЭлементы() Цикл
		Если ПодчиненнаяСтрока.НаправлениеДеятельности = ПараметрыПоискаСтроки.НаправлениеДеятельности Тогда
			ИскомаяСтрока = СтрокаПоСтатьеДДСРекурсивно(ПодчиненнаяСтрока, ПараметрыПоискаСтроки);
			Если ИскомаяСтрока = Неопределено Тогда
				// Подходит по направлению деятельности, но не нашли статью ДДС.
				// Такое может быть если расшифровываем целиком направление деятельности
				ИскомаяСтрока = ПодчиненнаяСтрока;
			КонецЕсли;
			Прервать;
		КонецЕсли;
		ИскомаяСтрока = СтрокаРасходыРекурсивно(ПодчиненнаяСтрока, ПараметрыПоискаСтроки)
	КонецЦикла;
	
	Возврат ИскомаяСтрока;
	
КонецФункции

Функция СтрокаПоСтатьеДДСРекурсивно(СтрокаДерева, ПараметрыПоискаСтроки)
	
	ИскомаяСтрока = Неопределено;
	Для Каждого ПодчиненнаяСтрока Из СтрокаДерева.ПолучитьЭлементы() Цикл
		Если ПодчиненнаяСтрока.СтатьяДДС = ПараметрыПоискаСтроки.СтатьяДДС Тогда
			ИскомаяСтрока = ПодчиненнаяСтрока;
			Прервать;
		КонецЕсли;
		ИскомаяСтрока = СтрокаПоСтатьеДДСРекурсивно(ПодчиненнаяСтрока, ПараметрыПоискаСтроки)
	КонецЦикла;
	
	Возврат ИскомаяСтрока;
	
КонецФункции

#КонецОбласти
